{
    "overview": "Hey there! I’m George Chen, an Electrical Engineering student at the University of Waterloo, experienced with various programming languages and basic electrical hardware. I love challenging myself and broadening my knowledge of new technologies in building relevant projects to evaluate my understanding. Some projects I recently finished are my chess app with a simple AI chess engine and my custom built portfolio website, both completely new programming applications I self-taught myself. Currently, I’m going to begin learning how to assemble various basic logic gates using transistor-transistor logic, complete an IoT Arduino garage door opener to learn more about microcontroller firmware and wireless technology and lastly learn PCB design and potentially build a PCBA at the end of this term. Some personal interests that are non-technology related are dragon & lion dance, classical piano, mechanical keyboards and camping.",
    "plangroup": "My time at Plan Group began with Project ALICE, an initiative to help improve the productivity of CAD design by developing custom tools for designers. I developed 5 different optimization tools in C# for Revit design. Subsequently, I transitioned to help with quality inspection control for electrical floor plan layouts in Revit for Sick Kids Hospital. In total, I examined over 40 layouts across two buildings, aiding in a 70% reduction in completion time per layout. Lastly, I designed plumbing and electrical fixtures in Revit for TD Bank electrical floor plan layouts and helped fix faulty conduit placements.",
    "marqueeText": "<span class='marqueeChild'>Python</span><span class='marqueeChild'>JavaScript</span><span class='marqueeChild'>C++</span><span class='marqueeChild'>C</span><span class='marqueeChild'>C#</span><span class='marqueeChild'>VHDL</span><span class='marqueeChild'>Java</span><span class='marqueeChild'>HTML</span><span class='marqueeChild'>CSS</span><span class='marqueeChild'>AutoCAD</span><span class='marqueeChild'>Altium Designer</span><span class='marqueeChild'>KiCAD</span><span class='marqueeChild'>LT Spice</span><span class='marqueeChild'>Fusion 360</span><span class='marqueeChild'>Revit</span>"
}